Revit 2027 API
ContourSetting.GetContourSettingItems Method
 Get all contour setting items.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ContourSettingItem> GetContourSettingItems()
Public Function GetContourSettingItems As IList(Of ContourSettingItem)
public:
IList<ContourSettingItem^>^ GetContourSettingItems()
member GetContourSettingItems : unit -> IList<ContourSettingItem>
Return Value
IList<ContourSettingItem>
 An array of contour setting items.
See Also
Reference
ContourSetting Class
Autodesk.Revit.DB Namespace